# CategoryNameMapIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CategoryNameMapIterator Class
Members See Also
---
An iterator to a category name map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class CategoryNameMapIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class CategoryNameMapIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class CategoryNameMapIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..CategoryNameMapIterator
# See Also
CategoryNameMapIterator Members
Autodesk.Revit.DB Namespace